import Accordion from "@mui/material/Accordion";
import AccordionSummary from "@mui/material/AccordionSummary";
import AccordionDetails from "@mui/material/AccordionDetails";
import ExpandMoreIcon from "@mui/icons-material/ExpandMore";
import { Box } from "@mui/material";
import { useTheme } from "@mui/material/styles";

export const Questions = () => {
  const theme = useTheme();

  const questions = [
    {
      title: "Для кого работает центр «ПодростОК»?",
      text: (
        <ul>
          <li>
            Дети и подростки в возрасте от 7 до 18 лет, испытывающие
            эмоциональные, поведенческие, социальные, семейные, учебные
            проблемы, трудности адаптации, профориентации, самооценки и др.
          </li>
          <li>
            Родители (законные представители), которые ищут помощь для своих
            детей и по вопросам детско-родительских отношений.
          </li>
          <li>
            Дети и взрослые, которым нужна психологическая поддержка при
            переживании кризисных ситуаций.
          </li>
          <li>
            Психологи, которым нужна супервизорская поддержка - профессиональное
            консультирование и рефлексия профессиональной деятельности.
          </li>
        </ul>
      ),
    },
    {
      title: "С какими вопросами можно обратиться в центр «ПодростОК» ?",
      text: (
        <ul>
          <li>
            Вопросы самооценки, стресса, тревожности, отношений, личностного
            роста, учебно-познавательной мотивации, улучшения
            психоэмоционального состояния, профориентации и других вопросов
          </li>
          <li>
            Вопросы детско-родительских отношений, помощь в разрешении
            конфликтных ситуаций, улучшении коммуникации и укреплении семейных
            связей
          </li>
          <li>
            Развитие навыков саморегуляции и управления эмоциями,
            коммуникативных навыков у подростков
          </li>
          <li>
            Обучение родителей методам поддержки подростков, пониманию их
            потребностей и особенностей
          </li>
          <li>
            Помощь при переживании психологических травм, насилия, конфликтов,
            потере близкого, суицидальных мыслей
          </li>
          <li>
            Супервизорская поддержка для специалистов помогающих профессий
          </li>
        </ul>
      ),
    },
    {
      title: "Как получить консультацию психолога в центр «ПодростОК»?",
      text: (
        <>
          <p>
            Консультации проводятся по предварительной записи по адресу: г.
            Сыктывкар, ул. Громова, д. 75, офис 410. Телефон для записи:
            +7(912)964-93-03.{" "}
            <span style={{ fontWeight: "500" }}>
              Психологические услуги несовершеннолетним гражданам оказываются с
              письменного согласия родителей (законных представителей)!
            </span>
          </p>
        </>
      ),
    },
    {
      title: "В каком формате оказывает услуги центр «ПодростОК»?",
      text: (
        <p>
          Вы можете получить индивидуальные консультации в очной и дистанционной
          (видеоконференцсвязь, телефонное консультирование) формах. Групповые
          консультации проводятся в очной форме.
        </p>
      ),
    },
  ];

  if (!questions.length) {
    return (
      <p style={{ textAlign: "center", opacity: "0.7" }}>
        Список вопросов пуст.
      </p>
    );
  }

  return (
    <Box sx={{ display: "flex", flexDirection: "column", gap: "16px" }}>
      {questions.map(({ title, text }) => (
        <Accordion
          disableGutters
          sx={{
            boxShadow: "0px 0px 4px 0px rgba(0, 0, 0, 0.2)",
            color: theme.palette.text.main,
            position: "static",
          }}
        >
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            sx={{
              fontWeight: "600",
              gap: "8px",
            }}
          >
            {title}
          </AccordionSummary>
          <AccordionDetails>{text}</AccordionDetails>
        </Accordion>
      ))}
    </Box>
  );
};
